{
    "emergency_type": {
        "A": {"name": "Unknown"},
        "*** Weather ***": {
            "B": {"name": "Rainy"},
            "C": {"name": "Dry"},
            "D": {"name": "Snow"},
            "E": {"name": "Storms"},
            "F": {"name": "Sunny"},
            "G": {"name": "Partly cloudy"},
            "H": {"name": "Overcast"},
            "I": {"name": "Windy"}
        },
        "*** Happy Days ***": {
            "J": {"name": "Christmas"},
            "K": {"name": "New Years"},
            "L": {"name": "Easter"},
            "M": {"name": "Independence Day"},
            "N": {"name": "Patriots Day"},
            "O": {"name": "TGIF"},
            "P": {"name": "Game Day"}
        },
        "*** Prepping ***": {
            "Q": {"name": "Power/Solar"},
            "R": {"name": "Food"},
            "S": {"name": "Shelter"},
            "T": {"name": "Gardening"},
            "U": {"name": "Security"}
        },
        "*** Communications ***": {
            "V": {"name": "Radio"},
            "W": {"name": "Antenna"},
            "X": {"name": "Internet/infrastructure"},
            "Y": {"name": "Software/operating systems"},
            "Z": {"name": "Training/Workshops"}
        }
    },
    "status_codes": {
        "*** Emotional Response ***": {
            "items": ["A", "B", "C", "D", "E", "F", "G", "H"],
            "description": "weather is like a rollercoaster ride of feelings, where you're either swooning over a picturesque sunset or cursing the rain that just ruined your perfectly planned picnic. It's the joy of a gentle breeze on a summer day, followed by the frustration of a power outage during a storm. So, whether you're in love with the serene calm of a snowfall or hating the muddy mess it leaves behind, one thing's for sure—weather has a way of keeping you on your emotional toes, making you question if it's your friend or your foe!",
            "order": 1
        },
        "*** Ready Response ***": {
            "items": ["I", "J", "K", "L", "M", "N"],
            "description": "A Ready response to a pending situation is like a well-rehearsed dance, where you've got your ducks in a row and your emergency kit packed. It's the calm before the storm, where you're channeling your inner Boy Scout, always prepared with a plan and a positive attitude. So, whether you're bracing for a blizzard or a big presentation, being ready means you're not just surviving the chaos—you're tangoing with it, and maybe even enjoying the twirls along the way!",
            "order": 2
        },
        "*** Not Ready Response ***": {
            "items": ["O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"],
            "description": "A Not Ready response to a pending situation is like trying to solve a Rubik's cube while blindfolded—you're scrambling, fumbling, and hoping for the best. It's the panic of realizing you forgot to charge your phone right before a blackout or the sinking feeling when you remember you never replaced the batteries in the smoke detector. So, when you're not ready, it's a wild ride of what ifs and why me? but hey, at least you'll have a good story to tell once the dust settles!",
            "order": 3
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Welcoming it"},
        "C": {"name": "Enjoying it"},
        "D": {"name": "Not looking forward to it"},
        "E": {"name": "Dreading it"},
        "F": {"name": "Taking it in stride"},
        "G": {"name": "Mildly annoyed"},
        "H": {"name": "Reserved"},
        "I": {"name": "On top of that"},
        "J": {"name": "It is what it is"},
        "K": {"name": "Stocked up"},
        "L": {"name": "Ready to go"},
        "M": {"name": "Exercise planned"},
        "N": {"name": "After-action analysis"},
        "O": {"name": "Almost ready"},
        "P": {"name": "Way behind"},
        "Q": {"name": "My next project"},
        "R": {"name": "Top off fuel"},
        "S": {"name": "Check comms systems"},
        "T": {"name": "Refresh medical kits"},
        "U": {"name": "Prepare pet plan"},
        "V": {"name": "Check on neighbors"},
        "W": {"name": "Plan evacuation route"},
        "X": {"name": "Schedule test exercise"},
        "Y": {"name": "Barter plan"},
        "Z": {"name": "Reserved"}
    },
    "public_reaction": {
        "A": {"name": "Unknown"},
        "B": {"name": "Joshua 1:9"},
        "C": {"name": "1 Samuel 17:45-47"},
        "D": {"name": "Esther 4:14-16"},
        "E": {"name": "Proverbs 25:28"},
        "F": {"name": "1 Corinthians 9:27"},
        "G": {"name": "Hebrews 12:11"},
        "H": {"name": "Reserved"},
        "I": {"name": "Proverbs 17:17"},
        "J": {"name": "Proverbs 3:3"},
        "K": {"name": "Revelation 2:10"},
        "L": {"name": "Hebrews 12:1-2"},
        "M": {"name": "James 1:2-4"},
        "N": {"name": "Romans 5:3-4"},
        "O": {"name": "Genesis 39:7-12"},
        "P": {"name": "Proverbs 25:28"},
        "Q": {"name": "1 Timothy 4:7-8"},
        "R": {"name": "1 Corinthians 9:24-27"},
        "S": {"name": "James 5:7-8"},
        "T": {"name": "Hebrews 6:15"},
        "U": {"name": "Proverbs 2:6"},
        "V": {"name": "James 3:17"},
        "W": {"name": "1 Kings 3:16-28"},
        "X": {"name": "Romans 5:5"},
        "Y": {"name": "Hebrews 6:19"},
        "Z": {"name": "Daniel 3"},
        "*** Courage ***": {
            "items": ["B", "C", "D"],
            "description": "Courage in Scripture is not defined the same way the world defines it. The world often sees courage as self-confidence or boldness in one’s own strength. In the Bible, however, courage is rooted in faith in God—a steadfast trust that He is sovereign, faithful, and present, no matter the circumstance. It's the resolve to stand firm in your beliefs, even when others pressure you to compromise. Courage means acting boldly, knowing that God is with you, no matter the danger. It's about taking risks for what is right, believing that God will support and protect you. When you feel overwhelmed, remember that true courage comes from faith and trust in a God. Embrace the challenges ahead, knowing that God is always by your side, encouraging you to be brave and steadfast in your journey. ",
            "order": 1
        },
        "*** Discipline ***": {
            "items": ["E", "F", "G", "H"],
            "description": "Biblical discipline is the courageous act of aligning your life with God's perfect will, a journey of sacrifice and perseverance that transforms your heart and blesses those around you. It is the unwavering commitment to self-control and obedience, even when faced with temptation and trials, knowing that every step brings you closer to the peaceful fruit of righteousness. Embrace this challenge with hope, for it is in this discipline that your faith is strengthened, your spirit is renewed, and your family, friends, and community are inspired and uplifted, all drawing closer to the loving presence of God.",
            "order": 2
        },
        "*** Loyalty ***": {
            "items": ["I", "J", "K"],
            "description": "Biblical loyalty is the steadfast commitment to God and those entrusted to your care, a promise kept through joy and sorrow. It is the unwavering dedication to stand by your convictions and those you love, even in the face of trials and temptations, knowing that such faithfulness is a testament to God's enduring love. Embrace this journey with courage, for your loyalty not only strengthens your faith but also provides a beacon of hope and security for your family, friends, and community, guiding them all closer to the unchanging presence of God.",
            "order": 3
        },
        "*** Endurance ***": {
            "items": ["L", "M", "N"],
            "description": "Biblical endurance is the steadfast perseverance in the face of life's challenges, a resolve to stand firm in faith even when the path is dark and uncertain. It is the commitment to press on, trusting in God's promises, knowing that trials are but opportunities for spiritual growth and transformation. Embrace this journey with unwavering hope, for your endurance not only deepens your relationship with God but also inspires those around you—family, friends, and community—to find strength and courage in their own trials, all drawing closer to the eternal peace of God.",
            "order": 4
        },
        "*** Self-control ***": {
            "items": ["O", "P"],
            "description": "Biblical self-control is the disciplined mastery over one's desires and impulses, a commitment to living in alignment with God's will, even when tempted by the fleeting pleasures of this world. It is the strength to choose righteousness, to act with wisdom and temperance, knowing that such restraint leads to a life of peace and purpose. Embrace this practice with confidence, for your self-control not only enriches your spiritual journey but also sets a powerful example for those around you—family, friends, and community—to follow, guiding them all towards the fulfilling path of God's grace.",
            "order": 5
        },
        "*** Training ***": {
            "items": ["Q", "R"],
            "description": "Biblical training is the intentional and ongoing process of cultivating godly character, a commitment to grow in wisdom, discipline, and spiritual maturity. It involves actively seeking God's guidance, studying His Word, and practicing obedience, knowing that each step is a building block towards a life of purpose and fulfillment. Embrace this journey with enthusiasm, for your dedication to training not only strengthens your faith but also inspires those around you—family, friends, and community—to pursue their own paths of growth and transformation, all drawing closer to the wisdom and love of God.",
            "order": 6
        },
        "*** Patience ***": {
            "items": ["S", "T"],
            "description": "Biblical patience is the quiet strength to wait on God's timing, trusting in His perfect plan even when the path is unclear or the wait seems endless. It is the commitment to endure with grace and hope, knowing that God's promises are unfailing and His timing is flawless. Embrace this virtue with peace, for your patience not only deepens your faith but also provides a calming presence for those around you—family, friends, and community—to find solace and encouragement, all drawing closer to the eternal patience and love of God.",
            "order": 7
        },
        "*** Wisdom ***": {
            "items": ["U", "V", "W"],
            "description": "Biblical wisdom is the discerning ability to make choices that honor God and align with His eternal truth, a gift that illuminates the path to righteousness and understanding. It is the commitment to seek God's counsel, to listen with a humble heart, and to act with insight and integrity. Embrace this treasure with gratitude, for your pursuit of wisdom not only enriches your life but also guides those around you—family, friends, and community—to navigate their own journeys with clarity and purpose, all drawing closer to the infinite wisdom and love of God.",
            "order": 8
        },
        "*** Hope ***": {
            "items": ["X", "Y", "Z"],
            "description": "Biblical hope is the unwavering assurance that God's promises are true and His love is eternal, a beacon that guides us through the darkest nights and brightest days. It is the commitment to trust in God's faithfulness, to anticipate His goodness, and to persevere with joy, knowing that our present trials are but fleeting shadows compared to the eternal light of His presence. Embrace this hope with confidence, for it not only sustains your spirit but also ignites a flame of encouragement for those around you—family, friends, and community—to find strength and courage, all drawing closer to the unshakable hope and love of God.",
            "order": 9
        }
    },
    "station_response": {
        "*** Full Operations ***": {
            "items": ["B", "C", "D", "E"],
            "description": "Station Status describes the operational condition of communication stations during an emergency, such as fully or partially functional.",
            "order": 1
        },
        "*** Partial Operations ***": {
            "items": ["F", "G", "H", "I", "J", "K"],
            "description": "Current condition indicates the environmental or safety state at the station, such as normal or unsafe conditions.",
            "order": 2
        },
        "*** Limited Operations ***": {
            "items": ["L", "M", "N", "O", "X"],
            "description": "Personal/Family Response covers actions taken by individuals or families, like sheltering in place or evacuating.",
            "order": 3
        },
        "*** Station Logistics ***": {
            "items": ["P", "Q", "R", "S", "T", "U", "V", "W", "Y", "Z"],
            "description": "Shelter/supplies addresses damage levels and needs for resources or transportation at the station.",
            "order": 4
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Normal conditions"},
        "C": {"name": "Normal conditions - little or no impact"},
        "D": {"name": "Normal conditions or Not in impact zone"},
        "E": {"name": "Normal conditions - monitoring situation"},
        "F": {"name": "Sub-optimal conditions or Sheltering in place"},
        "G": {"name": "Sub-optimal conditions or On the edge of impact zone"},
        "H": {"name": "Sub-optimal conditions or Moderate damage/impact"},
        "I": {"name": "Sub-optimal conditions or Minor injuries"},
        "J": {"name": "Sub-optimal conditions or Antenna damage"},
        "K": {"name": "Sub-optimal conditions or Power issues"},
        "L": {"name": "Severe/Unsafe conditions/Evacuation in process"},
        "M": {"name": "Severe/Unsafe conditions/In the center of impact zone"},
        "N": {"name": "Severe/Unsafe conditions/Sheltering in place"},
        "O": {"name": "Severe/Unsafe conditions/Serious injuries"},
        "P": {"name": "Needing shelter"},
        "Q": {"name": "Offering shelter"},
        "R": {"name": "Needing supplies"},
        "S": {"name": "Offering supplies"},
        "T": {"name": "Needing transportation"},
        "U": {"name": "Offering transportation"},
        "V": {"name": "Needing medical assistance"},
        "W": {"name": "Offering medical assistance"},
        "X": {"name": "Sub-optimal conditions/Antenna, power, equipment issues"},
        "Y": {"name": "Station relocated (alternate QTH)"},
        "Z": {"name": "Station unattended"}
    },
    "shared_impacts": {
        "*** Yard ***": {
            "items": ["B", "C", "D", "E", "F", "G", "H"],
            "description": "Yard work is the art of turning your outdoor space into a lush, green oasis—or at least trying to. It's a never-ending battle against nature's relentless quest to reclaim your lawn, one weed at a time. So, grab your rake and mower, and get ready to tango with the elements, because in the end, the yard always wins, but at least it looks good while you're losing!",
            "order": 1
        },
        "*** Home Repair ***": {
            "items": ["O", "P", "Q", "R", "S", "T"],
            "description": "Home Repair is the eternal dance of keeping your home from reverting to its natural state of chaos. It's a daily quest to battle the mysterious forces that cause socks to disappear and dishes to multiply. So, roll up your sleeves, armed with a mop and a sense of humor, because in the end, you might not conquer the clutter, but at least your home will be temporarily tricked into looking civilized!",
            "order": 2
        },
        "*** Auto/Equipment ***": {
            "items": ["I", "J", "K", "L", "M", "N"],
            "description": "Reserved for future use.",
            "order": 3
        },
        "*** Avoiding ***": {
            "items": ["U", "V", "W", "X", "Y", "Z"],
            "description": "Reserved impacts are placeholders for future social chitchat categories, allowing flexibility for emerging discussion topics.",
            "order": 4
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Mowing"},
        "C": {"name": "Trimming/Pruning"},
        "D": {"name": "Snow removal"},
        "E": {"name": "Fence build or repair"},
        "F": {"name": "Firewood"},
        "G": {"name": "Gardens"},
        "H": {"name": "Pest control"},
        "I": {"name": "Oil change"},
        "J": {"name": "Annual maintenance"},
        "K": {"name": "Chainsaw maintenance"},
        "L": {"name": "Generator maintenance"},
        "M": {"name": "Reserved"},
        "N": {"name": "Reserved"},
        "O": {"name": "Plumbing"},
        "P": {"name": "Roof"},
        "Q": {"name": "Windows"},
        "R": {"name": "HVAC"},
        "S": {"name": "Electrical"},
        "T": {"name": "Weatherproofing"},
        "U": {"name": "Taking out the trash"},
        "V": {"name": "Painting anything"},
        "W": {"name": "All chores"},
        "X": {"name": "Doing taxes"},
        "Y": {"name": "Paying bills"},
        "Z": {"name": "Social gatherings"}
    },
    "emergency_group_order": [
        "*** Weather ***",
        "*** Happy Days ***",
        "*** Prepping ***",
        "*** Communications ***"
    ],
    "impact_group_order": [
        "*** Yard ***",
        "*** Home Repair ***",
        "*** Auto/Equipment ***",
        "*** Avoiding ***"
    ],
    "group_descriptions": {
        "*** Communications ***": "Communications discussions address the tools and strategies for maintaining community dialogue, such as radio or internet-based networks, critical for coordinating social chitchat and event planning.",
        "*** Happy Days ***": "Holiday discussions focus on community engagement around festive events like Christmas or Easter, driving social cohesion but requiring coordination to manage gatherings and expectations.",
        "*** Prepping ***": "Prepping discussions involve planning for self-sufficiency, such as solar power, food storage, or shelter readiness, fostering proactive community resilience but requiring shared knowledge to avoid misinformation.",
        "*** Weather ***": "Weather discussions cover community sentiments and plans related to local conditions like rain, snow, or storms, influencing event planning and preparedness activities. These conversations shape social coordination and resource allocation.",
        "*** Emotional Response ***": "Emotional Response captures the community’s feelings toward social events or preparations, such as excitement for holidays or concern about weather, influencing discussion dynamics.",
        "*** Not Ready Response ***": "Not Ready Response indicates delays or lack of preparedness, such as being behind on prepping or planning, which can disrupt community coordination.",
        "*** Ready Response ***": "Ready Response reflects proactive engagement or preparedness, such as having supplies ready or planning for events, fostering positive community outcomes.",
        "*** Reserved ***": "Reserved impacts are placeholders for future social chitchat categories, allowing flexibility for emerging discussion topics.",
        "*** Yard ***": "Yard work is the art of turning your outdoor space into a lush, green oasis—or at least trying to. It's a never-ending battle against nature's relentless quest to reclaim your lawn, one weed at a time. So, grab your rake and mower, and get ready to tango with the elements, because in the end, the yard always wins, but at least it looks good while you're losing!",
        "*** Home Repair ***": "Home Repair is the eternal dance of keeping your home from reverting to its natural state of chaos. It's a daily quest to battle the mysterious forces that cause socks to disappear and dishes to multiply. So, roll up your sleeves, armed with a mop and a sense of humor, because in the end, you might not conquer the clutter, but at least your home will be temporarily tricked into looking civilized!",
        "*** Auto/Equipment ***": "Reserved for future use.",
        "*** Avoiding ***": "The Avoiding Chores group is a secret society of men who have mastered the art of procrastination, turning necessary tasks into a game of hide-and-seek with responsibility. These clever individuals have developed an impressive repertoire of tactics, from the classic I'll do it tomorrow to the more sophisticated I'm sure it can wait until the weekend. They are experts at finding creative distractions, whether it's an impromptu nap, a sudden interest in organizing the garage, or a mysterious need to research the history of lawn mowers. Despite their best efforts, the chores always seem to catch up, but that's just part of the thrill—knowing that one day, the laundry monster will emerge from the closet, and the dishes will form a towering fortress in the sink. Yet, until that day comes, they continue to dodge, weave, and hope that the universe will somehow do their bidding."
    },
    "gui_titles": {
        "select_list": "1. Select Discussion List:",
        "emergency": "2. Discussion Topic:",
        "status": "3. Discussion Response:",
        "primary": "4. Chores:",
        "secondary": "5. Inspiration:",
        "severity": "6. Station Status:"
    }
}