{
    "emergency_type": {
        "A": {"name": "Unknown"},
        "*** Infrastructure Disruption ***": {
            "B": {"name": "Power"},
            "C": {"name": "Water"},
            "D": {"name": "Gas pipeline"},
            "E": {"name": "Telecommunications"},
            "F": {"name": "Internet or network"},
            "G": {"name": "Cellular systems"},
            "H": {"name": "Sewer systems"},
            "I": {"name": "Reserved"}
        },
        "*** Structural Incidents ***": {
            "J": {"name": "Building collapse"},
            "K": {"name": "Bridge failure"},
            "L": {"name": "Urban flooding"},
            "M": {"name": "Dam or levee breach"},
            "N": {"name": "Reserved"}
        },
        "*** Explosions, Fires, and Hazardous Releases ***": {
            "O": {"name": "Explosion"},
            "P": {"name": "Structure fire"},
            "Q": {"name": "Wildfire"},
            "R": {"name": "Chemical spill or exposure"},
            "S": {"name": "Radiation alert or exposure"},
            "T": {"name": "Toxic gas release"}
        },
        "*** Transportation Incidents ***": {
            "U": {"name": "Railway incident"},
            "V": {"name": "Airplane incident"},
            "W": {"name": "Ship or boat incident"},
            "X": {"name": "Multi-vehicle incident"},
			"Y": {"name": "Highway incident"},
            "Z": {"name": "Reserved"}
        }
    },
    "status_codes": {
        "*** Structural ***": {
            "items": ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N"],
            "description": "Structural refer to unexpected events or failures that occur within or directly affect man-made buildings, facilities, or infrastructure. These incidents can range from the collapse of a single building to the failure of complex structures like bridges, dams, or industrial complexes. Structural incidents often result in immediate and significant disruption, posing risks to life, property, and the surrounding environment. They may be caused by a variety of factors, including material fatigue, design flaws, extreme weather conditions, or unexpected external forces. Examples of structural incidents include building collapses, bridge failures, and dam breaches, all of which require swift and coordinated emergency responses to mitigate their impact and ensure public safety.",
            "order": 1
        },
        "*** Geographic ***": {
            "items": ["O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"],
            "description": "Geographic Incidents encompass unexpected events or disruptions that occur within or affect specific geographic areas, regardless of the presence of structures. These incidents can range from local to national scales and may involve natural features, urban environments, or rural landscapes. Geographic incidents often have widespread impacts, affecting communities, infrastructure, and ecosystems within the defined area. They can be caused by a variety of factors, including natural phenomena, human activities, or unforeseen circumstances. Examples of geographic incidents include power outages, floods, and incidents in national parks, all of which require coordinated responses to address the unique challenges and impacts associated with the affected area.",
            "order": 2
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Single Structure"},
        "C": {"name": "Multiple Structure"},
        "D": {"name": "Religious Structure"},
        "E": {"name": "Educational Structure"},
        "F": {"name": "Industrial Structure"},
        "G": {"name": "Healthcare Structure"},
        "H": {"name": "Government Structure"},
        "I": {"name": "Transportation Structure"},
        "J": {"name": "Public Venue (Mass gatherings)"},
        "K": {"name": "Residential Complex"},
        "L": {"name": "Commercial Structure"},
        "M": {"name": "Utility Structure"},
        "N": {"name": "Industrial Complex"},
        "O": {"name": "Local Area"},
        "P": {"name": "Regional Area"},
        "Q": {"name": "National Area"},
        "R": {"name": "Waterway"},
        "S": {"name": "Coastal Area"},
        "T": {"name": "Forest or Mountainous Area"},
        "U": {"name": "Agricultural"},
        "V": {"name": "National or State Park"},
        "W": {"name": "Wildlife Refuge"},
        "X": {"name": "Residential District"},
        "Y": {"name": "Commercial District"},
        "Z": {"name": "City or Town"}
    },
    "public_reaction": {
        "*** Emotional ***": {
            "items": ["B", "C", "D", "E", "F", "G", "H", "I"],
            "description": "Emotional reactions in health emergencies trigger impulsive decisions that worsen outcomes, such as panicked hoarding of medical supplies or ignoring quarantine orders. This undermines coordination, causing delayed responses and misallocated resources—directly increasing preventable casualties. Trump Derangement Syndrome (TDS) manifests as an uncontrollable neurologica.",
            "order": 1
        },
        "*** Negative Actions ***": {
            "items": ["U", "V", "W", "X", "Y", "Z"],
            "description": "Negative public responses involve harmful or disruptive actions that hinder health emergency management, such as looting pharmacies or violent protests against health measures.",
            "order": 2
        },
        "*** Positive Actions ***": {
            "items": ["J", "K", "L", "M", "N"],
            "description": "Positive actions by thoughtful individuals in health emergencies override panic with disciplined cognition: adhering to health protocols, sharing accurate information, and prioritizing community safety—transforming chaos into calculated survival.",
            "order": 3
        },
        "*** Resistance ***": {
            "items": ["O", "P", "Q", "R", "S", "T"],
            "description": "Resistance in health emergencies manifests as defiant refusal to adapt—ignoring mask mandates, spreading misinformation about treatments, or rejecting vaccinations—transforming individual stubbornness into communal catastrophe.",
            "order": 4
        },
        "A": {"name": "Unknown "},
        "B": {"name": "Joy or Anticipation"},
        "C": {"name": "Apathy or unconcerned"},
        "D": {"name": "Concern or confusion"},
        "E": {"name": "Anxiety or fear"},
        "F": {"name": "Anger or despair"},
        "G": {"name": "LEFT: Jubilation.  RIGHT: Sorrow or Anger"},
        "H": {"name": "LEFT: Anger. RIGHT: Jubilation"},
        "I": {"name": "Disbelief"},
        "J": {"name": "Community Support"},
        "K": {"name": "Cooperation"},
        "L": {"name": "Volunteerism"},
        "M": {"name": "Compliant or peaceful"},
        "N": {"name": "Resource Sharing"},
        "O": {"name": "Non-Compliance"},
        "P": {"name": "Misinformation campaign"},
        "Q": {"name": "Defiance"},
        "R": {"name": "Online mobilization"},
        "S": {"name": "Counter-protest mobilization"},
        "T": {"name": "Reserved"},
        "U": {"name": "Rioting or Looting"},
        "V": {"name": "Hoarding"},
        "W": {"name": "Violence"},
        "X": {"name": "Protests"},
        "Y": {"name": "Civil Unrest"},
        "Z": {"name": "Vigilantism"}
    },
    "station_response": {
        "*** Full Operations ***": {
            "items": ["B", "C", "D", "E"],
            "description": "Station Status describes the operational condition of communication stations during an emergency, such as fully or partially functional.",
            "order": 1
        },
        "*** Partial Operations ***": {
            "items": ["F", "G", "H", "I", "J", "K", "X"],
            "description": "Current condition indicates the environmental or safety state at the station, such as normal or unsafe conditions.",
            "order": 2
        },
        "*** Limited Operations ***": {
            "items": ["L", "M", "N", "O"],
            "description": "Personal/Family Response covers actions taken by individuals or families, like sheltering in place or evacuating.",
            "order": 3
        },
        "*** Station Logistics ***": {
            "items": ["P", "Q", "R", "S", "T", "U", "V", "W", "Y", "Z"],
            "description": "Shelter/supplies addresses damage levels and needs for resources or transportation at the station.",
            "order": 4
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Normal conditions"},
        "C": {"name": "Normal conditions - little to no impact"},
        "D": {"name": "Normal conditions or Not in impact zone"},
        "E": {"name": "Normal conditions - monitoring situation"},
        "F": {"name": "Sub-optimal conditions or Sheltering in place"},
        "G": {"name": "Sub-optimal conditions or On the edge of impact zone"},
        "H": {"name": "Sub-optimal conditions or Moderate damage/impact"},
        "I": {"name": "Sub-optimal conditions or Minor injuries"},
        "J": {"name": "Sub-optimal conditions or Antenna damage"},
        "K": {"name": "Sub-optimal conditions or Power issues"},
        "L": {"name": "Severe/Unsafe conditions/Evacuation in process"},
        "M": {"name": "Severe/Unsafe conditions/In the center of impact zone"},
        "N": {"name": "Severe/Unsafe conditions/Sheltering in place"},
        "O": {"name": "Severe/Unsafe conditions/Serious injuries"},
        "P": {"name": "Needing shelter"},
        "Q": {"name": "Offering shelter"},
        "R": {"name": "Needing supplies"},
        "S": {"name": "Offering supplies"},
        "T": {"name": "Needing transportation"},
        "U": {"name": "Offering transportation"},
        "V": {"name": "Needing medical assistance"},
        "W": {"name": "Offering medical assistance"},
        "X": {"name": "Sub-optimal conditions/Antenna, power, or equipment failure"},
        "Y": {"name": "Station relocated (alternate QTH)"},
        "Z": {"name": "Station Unattended"}
    },
    "shared_impacts": {
        "*** Authority Reaction ***": {
            "items": ["O", "P", "Q", "R", "S", "T"],
            "description": "Authority Reaction describes the deployment of health officials, police, or military to enforce health measures or manage outbreaks, balancing stabilization with potential public backlash.",
            "order": 3
        },
        "*** Health Impacts ***": {
            "items": ["B", "C", "D", "E", "F", "G", "H"],
            "description": "Health Impacts resulting from an attack encompass the immediate and long-term physical and psychological effects on individuals and communities affected by the violence. These impacts can range from severe injuries and fatalities to chronic health conditions and mental health disorders. Immediate health impacts include trauma from physical injuries, such as gunshot wounds, explosions, or blunt force trauma, which can lead to amputations, internal bleeding, and other life-threatening conditions. Long-term health impacts may involve chronic pain, disabilities, and post-traumatic stress disorder (PTSD), which can significantly impair an individual's quality of life and ability to function. Additionally, the psychological toll of witnessing or experiencing violence can manifest as anxiety, depression, and substance abuse disorders. Health impacts also extend to the broader community, affecting healthcare systems through increased demand for medical services and resources, as well as creating a ripple effect of emotional and social strain. The severity and longevity of these health impacts depend on the scale of the attack, the availability of medical care, and the resilience of the affected population.",
            "order": 1
        },
        "*** Infrastructure Impacts ***": {
            "items": ["U", "V", "W", "X", "Y", "Z"],
            "description": "An Infrastructure Attack targets the critical systems and networks that support the functioning of a society or organization, aiming to disrupt, damage, or destroy essential services. This type of attack can involve physical destruction, cyber intrusion, or a combination of both, and is designed to create widespread chaos and instability. Infrastructure attacks often focus on high-value targets such as power grids, communication networks, transportation systems, or water supply facilities. The goal is to paralyze the target's ability to respond and recover, exacerbating the impact of the attack and prolonging the disruption. Such attacks may be carried out by state actors, terrorist organizations, or hacker groups, and can have devastating consequences for public safety, economic stability, and national security. The success of an infrastructure attack often depends on the element of surprise, the sophistication of the tactics employed, and the vulnerability of the targeted systems.",
            "order": 4
        },
        "*** Social Impacts ***": {
            "items": ["I", "J", "K", "L", "M", "N"],
            "description": "Social Impacts measure disruptions to community structures, including quarantine measures, evacuations, or economic strain due to health-related restrictions—potentially destabilizing regions for months.",
            "order": 2
        },
        "A": {"name": "Unknown"},
        "B": {"name": "Casualties"},
        "C": {"name": "Injuries"},
        "D": {"name": "Mass Casualties"},
        "E": {"name": "Toxic Contamination"},
        "F": {"name": "Medical system overload"},
        "G": {"name": "Reserved"},
        "H": {"name": "Reserved"},
        "I": {"name": "Quarantine"},
        "J": {"name": "Evacuation"},
        "K": {"name": "Lockdown"},
        "L": {"name": "Curfew"},
        "M": {"name": "Economic Disruption"},
        "N": {"name": "Supply Chain Disruption"},
        "O": {"name": "Health official deployment/response"},
        "P": {"name": "National Guard deployment/response"},
        "Q": {"name": "Military deployment/response"},
        "R": {"name": "FEMA or CDC response"},
        "S": {"name": "International or forign assistance"},
        "T": {"name": "Monitoring situations"},
        "U": {"name": "Power grid failure"},
        "V": {"name": "Data Breach/Loss"},
        "W": {"name": "Communications infrastructure failure"},
        "X": {"name": "Medical systems failure"},
        "Y": {"name": "Financial systems failure"},
        "Z": {"name": "Critical systems failure"}
    },
    "emergency_group_order": [
        "*** Infrastructure Disruption ***",
        "*** Structural Incidents ***",
        "*** Explosions, Fires, and Hazardous Releases ***",
        "*** Transportation Incidents ***",
        "*** Infrastructure Failure ***"
    ],
    "impact_group_order": [
        "*** Health Impacts ***",
        "*** Social Impacts ***",
        "*** Authority Reaction ***",
        "*** Infrastructure Impacts ***"
    ],
    "group_descriptions": {
        "*** Explosions, Fires, and Hazardous Releases ***": "Explosions, Fires, and Hazardous Releases are sudden, unpredictable events that can occur in various settings, causing immediate and severe damage. Explosions, often due to gas leaks or electrical malfunctions, can result in widespread destruction and injuries. Fires, starting from sources like electrical faults or cooking accidents, can quickly escalate, consuming everything in their path and producing toxic smoke. Hazardous Releases involve the unintended discharge of dangerous substances, contaminating the environment and posing health risks. These incidents require prompt and coordinated emergency responses, including fire suppression, evacuation, and containment of hazardous materials. The unpredictability of these events highlights the need for robust safety protocols and emergency preparedness plans.",
        "*** Structural Incidents ***": "Structural Incidents encompass a range of catastrophic events involving the failure or collapse of man-made structures designed to withstand significant loads and environmental conditions. These incidents often result in severe damage, injuries, and potential loss of life.",
        "*** Infrastructure Disruption ***": "Infrastructure disruption, refers to the breakdown or malfunction of essential systems and networks that support the functioning of a society or organization. This type of failure can occur due to a variety of reasons, including natural disasters, aging infrastructure, maintenance neglect, or unforeseen technical issues. For example, a power grid failure might be caused by severe weather conditions that damage transmission lines, or a water supply system might collapse due to corroded pipes and inadequate maintenance. These failures can have widespread and devastating effects, disrupting daily life, impacting economic activities, and sometimes leading to secondary issues such as healthcare crises or communication blackouts. The recovery from such failures often requires significant resources and time, highlighting the importance of regular maintenance and contingency planning to ensure the resilience and reliability of critical infrastructure.",
        "*** Transportation Incidents ***": "Transportation Incidents encompass a range of accidents and failures involving various modes of transportation, such as railways, aircraft, automobiles, and other vehicles, where the initial cause is unknown. These incidents can occur on roads, railways, in the air, or at sea, and often result in significant disruption, injuries, and potential loss of life. Railway incidents may include train derailments, collisions, or signal failures, while aircraft incidents can involve crashes, mid-air collisions, or unexplained losses of communication. Automobile incidents might include multi-vehicle pile-ups, single-vehicle crashes, or unexplained vehicle malfunctions. The complexity of these incidents often necessitates thorough investigations to determine the underlying causes, which could range from mechanical failures to human error or environmental factors. The unpredictable nature of Transportation Incidents underscores the importance of robust safety measures and emergency response protocols to ensure the safety of passengers and the public.",
        "*** Violent Physical Incidents ***": "Violent physical incidents involve direct physical attacks using weapons, vehicles, or explosives, causing immediate harm, panic, or infrastructure damage, requiring rapid law enforcement and medical response.",
        "*** Authority Reaction ***": "Authority Reaction describes the deployment of health officials, police, or military to enforce health measures or manage outbreaks, balancing stabilization with potential public backlash.",
        "*** Health Impacts ***": "Health Impacts quantify physical harm from health emergencies, including infections, long-term health effects, or fatalities, with risks of overwhelming healthcare systems and spiking mortality.",
        "*** Infrastructure Impacts ***": "Infrastructure Impacts involve damage to critical systems like hospitals, communication networks, or supply chains, amplifying secondary effects like delayed treatment or economic loss.",
        "*** Social Impacts ***": "Social Impacts measure disruptions to community structures, including quarantine measures, evacuations, or economic strain due to health-related restrictions—potentially destabilizing regions for months."
    },
    "gui_titles": {
        "select_list": "1. Select Emergency List:",
        "emergency": "2. Event:",
        "status": "3. Venue or Area:",
        "primary": "4. Impacts:",
        "secondary": "5. Response:",
        "severity": "6. Station Status:"
    }
}